// << 배열 객체 >>
// 변수에는 데이터가 한 개만 저장된다. 그렇다면 여러개의 데이터를 하나의 장소에 저장하려면 어떻게 해야할까?
// 여러 개의 데이터를 하나의 저장소에 저장하려면 배열 객체(Array Object)를 생성하면 된다.
// 배열은 '나눌 배'와 '열거할 열'을 사용해 만든 글자로, 글자 뜻 그대로 하나의 저장소를 나눠서 데이터를 열거하라는 의미다.

// 

// < 배열 객체의 메서드 및 속성 >
// 배열 객체에서 사용할 수 있는 메서드와 속성이다. 다음 메서드와 속성을 적절히 활용하면 배열의 순서를 바꿀 수 있을 뿐만 아니라 배열 객체에 새 데이터의 삽입과 삭제도 가능하다.

// join(연결 문자) => 배열 객체의 데이터를 연결 문자 기준으로 1개의 문자형 데이터로 반환한다.
// reverse() => 배열 객체의 데이터 순서를 거꾸로 바꾼후 반환한다.
// sort() => 배열 객체의 데이터를 오름차순으로 정렬한다.
// slice(index1, index2) => 배열 객체의 데이터중 원하는 인덱스 구간만큼 잘라서 배열 객체로 가져온다.
//  splice() => 배열 객체의 지정 데이터를 삭제하고 그 구간에서 새 데이터를 삽입할 수 있다.
// concat() => 2개의 배열 객체를 하나로 결합한다.
// pop() => 배열에 저장된 데이터 중 마지막 인덱스에 저장된 데이터를 삭제한다.
// push(new data) => 배열 객체의 마지막 인덱스에 새 데이터를 삽입한다.
// shift() => 배열 객체에 저장된 데이터 중 첫번째 인덱스에 저장된 데이터를 삭제한다.
// unshift(new data) => 배열 객체의 가장 앞의 인덱스에 새 데이터를 삽입한다.
// length() => 배열에 저장된 총 데이터의 개수를 반환한다.

document.write("<br/>")
document.write("============내가 해보기============")
document.write("<br/>")


// document.write("<br/>")
// document.write("============================================")
// document.write("<br/>")