// // const x = 10;
// // const y = 4;
// // console.log(x + 4);
// // // => 터미널에 14라고나온다

// // console.log(x - 4);
// // // => 터미널에 6라고나온다

// // console.log(x * 4);
// // // => 터미널에 40라고나온다

// // console.log(x / 4);
// // // => 터미널에 2.5라고나온다

// // -----------------------------

// // % , ++ , --
// // 두 값을 더하고 나누기한다음에 나머지 값을 찾아온다

// // ++
// // 증감 연산자 (값을증가시킨다)

// // --
// // 증가 연산자 (값을증가시킨다)

// let a = 10;
// a = ++a;
// a = --a
// a = a++
// // 증감연산자++랑 피연산자a랑 위치에 따라 값이 다르게나온다

// console.log(a);

// ----------------------------------------------

// // < 연결연산자 >
// let name = "홍길동";

// console.log(name + "님 안녕하세요");

// -----------------------------------------------
// < 할당연산자 > : 값을준다
// y = y + x
// 와
// y += x
// 는 같은 개념이다
// y에 y+x값을 할당한다

// y = y - x
// 와
// y -= x
// 는 같은 개념이다

// y = y * x
// 와
// y *= x
// 는 같은 개념이다

// y = y / x
// 와
// y /= x
// 는 같은 개념이다

// y = y % x
// 와
// y %= x
// 는 같은 개념이다

// let str = "<table border='1'>";
// str += "<tr>"
// str += "<td>1</td><td>2</td><td>3</td>"
// str += "</tr>"
// str += </table>

// document.write(str)



// -------------------------------------------
// < 비교연산자 >


// 얕은비교 - 형태는 보지 않고 안에 들어간 속성만 본다
console.log(3 == 3);
// true라고 나온다

console.log(3! == 3);
// !은 not의 의미다
// false라고나온다

console.log(3 == "3");
// true라고 나온다


// 깊은비교 - 속성까지도 본다 - 실무에서 많이쓴다
console.log(3 === "3");
// false라고나온다



// -------------------------------------------
// < 논리연산자 >
// A이도 참이고 B도 참일경우  and개념 =>   A && B
// 둘중하나만 참일경우        or개념 =>   A || B
//                           not개념 =>   A |! B